reprop_prelim/system/blockMeshDict
/*---------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (  0   0   0)    // 0
    (250   0   0)    // 1
    (250 250   0)    // 2
    (  0 250   0)    // 3
    (  0   0 200)    // 4
    (250   0 200)    // 5
    (250 250 200)    // 6
    (  0 250 200)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 100) simpleGrading (1 1 10)
);

boundary
(
    surface
    {
        type wall;
        faces ((0 1 2 3));
    }
    seabed
    {
        type wall;
        faces ((4 5 6 7));
    }
    left
    {
        type cyclic;
        neighbourPatch right;
        faces ((0 4 7 3));
    }
    right
    {
        type cyclic;
        neighbourPatch left;
        faces ((1 2 6 5));
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces ((0 1 5 4));
    }
    back
    {
        type cyclic;
        neighbourPatch front;
        faces ((3 2 6 7));
    }
);

// ************************************************************************* //

