reprop_prelim/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
250000
(
(0.4383320479 -0.08846899132 -0.0001098824144)
(0.439178122 -0.088423676 -0.001495919967)
(0.4388084566 -0.08856342519 -0.000215525237)
(0.438592023 -0.08806378998 0.001164992134)
(0.4391327747 -0.08818558054 -0.0007368881552)
(0.4374614759 -0.08804974552 0.001312514274)
(0.4385177951 -0.08840241101 0.0005332096675)
(0.4370225929 -0.08860836503 0.0004917959797)
...
)
;

boundaryField
{
    surface
    {
        type            fixedShearStress;
        tau             ( 9.8e-05 0 0 );
        value           uniform ( 0 0 0 );
    }
    seabed
    {
        type            noSlip;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
