reprop_prelim/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
250000
(
(2.5 2.5 0.254794)
(7.5 2.5 0.254794)
(12.5 2.5 0.254794)
(17.5 2.5 0.254794)
(22.5 2.5 0.254794)
(27.5 2.5 0.254794)
(32.5 2.5 0.254794)
(37.5 2.5 0.254794)
...
)
;

boundaryField
{
    surface
    {
        type            calculated;
        value           nonuniform List<vector> 
2500
(
(2.5 2.5 0)
(2.5 7.5 0)
(2.5 12.5 0)
(2.5 17.5 0)
(2.5 22.5 0)
(2.5 27.5 0)
(2.5 32.5 0)
(2.5 37.5 0)
...
)
;
    }
    seabed
    {
        type            calculated;
        value           nonuniform List<vector> 
2500
(
(2.5 2.5 200)
(2.5 7.5 200)
(2.5 12.5 200)
(2.5 17.5 200)
(2.5 22.5 200)
(2.5 27.5 200)
(2.5 32.5 200)
(2.5 37.5 200)
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
