reprop_prelim/0/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
|  \\    /  F ield         | OpenFOAM                                         |
|   \\  /   O peration     |                                                 |
|    \\/    M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
250000
(
36.18063268
36.18063268
36.18063268
36.18063268
36.18063268
36.18063268
36.18063268
36.18063268
...
);

boundaryField
{
    surface
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
    seabed
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}

// ************************************************************************* //
