reprop_prelim/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    surface
    {
        type            calculated;
        value           uniform 0;
    }
    seabed
    {
        type            calculated;
        value           uniform 0;
    }
    left  { type cyclic; }
    right { type cyclic; }

    defaultFaces
    {
        type empty;
    }
}


// ************************************************************************* //
