reprop_prelim/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p      { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0.01; }
    pFinal { $p; relTol 0; }
    "(U|T|S|k|nut).*" { solver PBiCGStab; preconditioner DILU; tolerance 1e-8; relTol 0; }
}

PIMPLE
{
    momentumPredictor          yes;
    nOuterCorrectors           1;
    nCorrectors                3;
    nNonOrthogonalCorrectors   0;
    pRefCell                   0;
    pRefValue                  0;
}
